{
  "sessionId": "2e019b9d-d7e6-4672-a592-bbc7fdb0b9fd",
  "query": "How can F1 visa students legally earn money in the US? What are the loopholes, exceptions, and lesser-known opportunities beyond standard CPT/OPT employment?",
  "minRoots": 5,
  "currentRound": 3,
  "currentBatch": 0,
  "nodes": {
    "R1.A": {
      "id": "R1.A",
      "parent": null,
      "state": "DRILL",
      "title": "On-Campus Employment Loopholes",
      "findings": "On-campus employment has key loopholes: 1) Educationally affiliated off-campus entities qualify (research parks, hospitals), 2) Remote work FOR the university is permitted, 3) Unlimited hours during breaks, 4) Commercial vendors on campus (Starbucks, bookstores) count as on-campus. Avoid federal work-study.",
      "children": [
        "R2.A1",
        "R2.A2"
      ],
      "round": 1
    },
    "R1.B": {
      "id": "R1.B",
      "parent": null,
      "state": "VALID",
      "title": "Passive Income Streams",
      "findings": "Passive income is LEGAL: Stock dividends/capital gains allowed, crypto trading (personal not business), royalties from pre-US IP, rental income, and bank interest (TAX-FREE for non-residents in first 5 years). Key: no material participation.",
      "children": [],
      "round": 1
    },
    "R1.C": {
      "id": "R1.C",
      "parent": null,
      "state": "DRILL",
      "title": "Severe Economic Hardship",
      "findings": "Severe Economic Hardship authorization allows off-campus work (20hrs/week, full-time on breaks). Requires 1 year in F1 status, DSO endorsement, unforeseen circumstances proof. 3-6 month processing. Special Student Relief (SSR) is faster for designated countries.",
      "children": [
        "R2.C1",
        "R2.C2"
      ],
      "round": 1
    },
    "R1.D": {
      "id": "R1.D",
      "parent": null,
      "state": "DEAD",
      "title": "Foreign Remote Work",
      "findings": "Foreign remote work is NOT a safe loophole. No explicit authorization exists. Immigration attorneys divided. Tax obligations apply regardless. High risk for visa revocation and future green card issues. CPT/OPT are the legitimate pathways.",
      "children": [],
      "round": 1
    },
    "R1.E": {
      "id": "R1.E",
      "parent": null,
      "state": "VALID",
      "title": "Non-Employment Income",
      "findings": "Non-employment income allowed: Scholarships (tax-free for tuition), fellowships, competition prizes (taxable but legal), family gifts (unlimited, report >$100K). AVOID Patreon/ongoing crowdfunding. Check tax treaties for exemptions.",
      "children": [],
      "round": 1
    },
    "R2.A1": {
      "id": "R2.A1",
      "parent": "R1.A",
      "state": "VALID",
      "title": "Affiliated Entity Exploitation",
      "findings": "Educationally affiliated locations include: research facilities with faculty supervision, university hospitals, research parks with partnership agreements, satellite campuses. Requires formal contractual relationship. Check with ISSO for approved list. Need 'On-but-off Campus Work Authorization Form' at many schools.",
      "children": [],
      "round": 2
    },
    "R2.A2": {
      "id": "R2.A2",
      "parent": "R1.A",
      "state": "VALID",
      "title": "Break Period Maximization",
      "findings": "Stack multiple jobs during breaks to hit 40hr limit. Apply Sept-Nov for summer (66% hire then). Highest pay: tutoring $15-40/hr, TA $15-25/hr, research assistant $12-20/hr. Build professor relationships early for referral-based hiring.",
      "children": [],
      "round": 2
    },
    "R2.C1": {
      "id": "R2.C1",
      "parent": "R1.C",
      "state": "VALID",
      "title": "SSR Country List",
      "findings": "Current SSR countries: Ukraine (until Apr 2025), Venezuela (until Sep 2025), Ethiopia (until Dec 2025). SSR allows 40hrs/week DURING semester, reduced course load, faster processing via DSO. No individual hardship proof needed.",
      "children": [],
      "round": 2
    },
    "R2.C2": {
      "id": "R2.C2",
      "parent": "R1.C",
      "state": "VALID",
      "title": "Hardship Documentation Strategies",
      "findings": "Key docs: 1) Currency charts from official sources showing post-F1 devaluation, 2) Sponsor affidavit with evidence of changed circumstances, 3) Proof on-campus work exhausted (rejection emails), 4) Before/after bank statements. DSO must enter in SEVIS first.",
      "children": [],
      "round": 2
    },
    "R1.F": {
      "id": "R1.F",
      "parent": null,
      "state": "VALID",
      "title": "CPT Loopholes",
      "findings": "Day 1 CPT allows work from first day at ~25 universities (Westcliff, Trine, Harrisburg, etc.). Part-time CPT is UNLIMITED and doesn't affect OPT eligibility - only 12+ months full-time CPT disqualifies OPT. Multiple CPT employers allowed simultaneously. Risk: USCIS scrutiny on visa mills.",
      "children": [],
      "round": 1
    },
    "R1.G": {
      "id": "R1.G",
      "parent": null,
      "state": "VALID",
      "title": "Business Ownership",
      "findings": "F1 students CAN own LLC/corporation but CANNOT actively work for it. Passive ownership allowed: dividends, profit distributions, owner's draws. Angel investing permitted. Hire managers to run business while remaining passive owner. Must file taxes on all passive income.",
      "children": [],
      "round": 1
    }
  },
  "pendingProposals": {},
  "createdAt": "2026-01-28T04:10:29.107Z",
  "updatedAt": "2026-01-28T04:22:08.999Z"
}