{
  "sessionId": "64dea8de-1a31-401b-b78b-52dd0b232de7",
  "query": "What are the lesser-known LEGAL ways for F1 international students to earn money in the United States? Include on-campus options, CPT/OPT strategies, passive income methods, business ownership rules, and any legitimate pathways that students often overlook.",
  "minRoots": 5,
  "currentRound": 1,
  "currentBatch": 1,
  "nodes": {
    "R1.A": {
      "id": "R1.A",
      "parent": null,
      "state": "VALID",
      "title": "On-Campus Employment Loopholes",
      "findings": "On-campus employment is broadly defined by USCIS to include commercially operated facilities on campus (Starbucks, Barnes & Noble, etc.). Students can work 20hrs/week during school, full-time during breaks. Lesser-known jobs: simulation patient actors, esports facility workers, observatory assistants, sleep study participants.",
      "children": [],
      "round": 1
    },
    "R1.B": {
      "id": "R1.B",
      "parent": null,
      "state": "DRILL",
      "title": "CPT/OPT Strategy Optimization",
      "findings": "Key strategies: Day-1 CPT programs exist at some schools, part-time CPT doesn't affect OPT eligibility (full-time CPT over 12 months kills OPT), STEM OPT adds 24 months. Maximum theoretical: 6 years across two STEM degrees. Economic hardship authorization available for unforeseen circumstances.",
      "children": [],
      "round": 1
    },
    "R1.C": {
      "id": "R1.C",
      "parent": null,
      "state": "DRILL",
      "title": "Passive Income Methods",
      "findings": "Allowed: stock dividends, rental income (use property manager), royalties, bank interest (often tax-exempt). Gray area: YouTube/content creation - controversial, depends on activity level. Not allowed: actively selling digital products. 30% flat tax on most passive income unless treaty applies.",
      "children": [],
      "round": 1
    },
    "R1.D": {
      "id": "R1.D",
      "parent": null,
      "state": "DRILL",
      "title": "Business Ownership Rules",
      "findings": "F1 students CAN own LLCs/corporations but CANNOT work for them without authorization. Must be truly passive - hire others to operate. E-commerce/dropshipping is high-risk because it requires active management. OPT allows working for your own startup in your field.",
      "children": [],
      "round": 1
    },
    "R1.E": {
      "id": "R1.E",
      "parent": null,
      "state": "VALID",
      "title": "Non-Employment Income Streams",
      "findings": "Clearly allowed: scholarships (unlimited), fellowships, research stipends (if no work required), competition/hackathon prizes, academic awards, crowdfunding donations, family gifts. All taxable except gifts and qualified education expenses.",
      "children": [],
      "round": 1
    }
  },
  "pendingProposals": {},
  "createdAt": "2026-01-28T03:16:12.873Z",
  "updatedAt": "2026-01-28T03:18:35.593Z"
}